Show / Hide Table of Contents
Class PointResultOfNLA
Point Result of NLA
Inheritance
System.Object
PointResultBase
PointResultOfNLA
Inherited Members
 PointResultBase.Loading
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
public class PointResultOfNLA : PointResultBase
Properties
Improve this Doc   View Source
AxialForce
Axial force
Declaration
public double AxialForce { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
AxialStrain
Axial strain
Declaration
public double AxialStrain { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
AxialStress
Axial stress
Declaration
public double AxialStress { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source